-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2026-03-17 11:50:57
-- 伺服器版本： 10.4.32-MariaDB
-- PHP 版本： 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `secbookstore`
--
CREATE DATABASE IF NOT EXISTS `secbookstore` DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci;
USE `secbookstore`;

-- --------------------------------------------------------

--
-- 資料表結構 `cart`
--
-- 建立時間： 2026-03-17 10:02:18
--

DROP TABLE IF EXISTS `cart`;
CREATE TABLE `cart` (
  `cartId` int(255) NOT NULL,
  `cartCreateTime` timestamp(6) NOT NULL DEFAULT current_timestamp(6) ON UPDATE current_timestamp(6),
  `id` int(255) NOT NULL,
  `transId` int(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 資料表新增資料前，先清除舊資料 `cart`
--

TRUNCATE TABLE `cart`;
-- --------------------------------------------------------

--
-- 資料表結構 `class`
--
-- 建立時間： 2026-03-17 10:35:31
--

DROP TABLE IF EXISTS `class`;
CREATE TABLE `class` (
  `classNo` int(255) NOT NULL,
  `department` varchar(255) NOT NULL,
  `eduSystem` char(255) NOT NULL,
  `major` char(255) NOT NULL,
  `grade` varchar(5) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- 資料表新增資料前，先清除舊資料 `class`
--

TRUNCATE TABLE `class`;
--
-- 傾印資料表的資料 `class`
--

INSERT INTO `class` (`classNo`, `department`, `eduSystem`, `major`, `grade`) VALUES
(1, '日間部', '五專', '國際貿易與經營科', '一年級'),
(2, '日間部', '五專', '國際貿易與經營科', '二年級'),
(3, '日間部', '五專', '國際貿易與經營科', '三年級'),
(4, '日間部', '五專', '國際貿易與經營科', '四年級'),
(5, '日間部', '五專', '國際貿易與經營科', '五年級'),
(6, '日間部', '四技', '國際貿易與經營系', '一年級'),
(7, '日間部', '四技', '國際貿易與經營系', '二年級'),
(8, '日間部', '四技', '國際貿易與經營系', '三年級'),
(9, '日間部', '四技', '國際貿易與經營系', '四年級'),
(10, '日間部', '二技', '國際貿易與經營系', '一年級'),
(11, '日間部', '二技', '國際貿易與經營系', '二年級'),
(12, '進修部', '四技', '國際貿易與經營系', '一年級'),
(13, '進修部', '四技', '國際貿易與經營系', '二年級'),
(14, '進修部', '四技', '國際貿易與經營系', '三年級'),
(15, '進修部', '四技', '國際貿易與經營系', '四年級'),
(16, '進修部', '二技', '國際貿易與經營系', '一年級'),
(17, '進修部', '二技', '國際貿易與經營系', '二年級'),
(18, '日間部', '碩士班', '會計資訊系', '一年級'),
(19, '日間部', '碩士班', '會計資訊系', '二年級'),
(20, '日間部', '碩士在職專班', '會計資訊系', '一年級'),
(21, '日間部', '碩士在職專班', '會計資訊系', '二年級'),
(22, '日間部', '四技', '會計資訊系', '一年級'),
(23, '日間部', '四技', '會計資訊系', '二年級'),
(24, '日間部', '四技', '會計資訊系', '三年級'),
(25, '日間部', '四技', '會計資訊系', '四年級'),
(26, '日間部', '二技', '會計資訊系', '一年級'),
(27, '日間部', '二技', '會計資訊系', '二年級'),
(28, '日間部', '五專', '會計資訊科', '一年級'),
(29, '日間部', '五專', '會計資訊科', '二年級'),
(30, '日間部', '五專', '會計資訊科', '三年級'),
(31, '日間部', '五專', '會計資訊科', '四年級'),
(32, '日間部', '五專', '會計資訊科', '五年級'),
(33, '進修部', '四技', '會計資訊系', '一年級'),
(34, '進修部', '四技', '會計資訊系', '二年級'),
(35, '進修部', '四技', '會計資訊系', '三年級'),
(36, '進修部', '四技', '會計資訊系', '四年級'),
(37, '進修部', '二技', '會計資訊系', '一年級'),
(38, '進修部', '二技', '會計資訊系', '二年級'),
(39, '日間部', '碩士班', '保險金融管理系', '一年級'),
(40, '日間部', '碩士班', '保險金融管理系', '二年級'),
(41, '日間部', '四技', '保險金融管理系', '一年級'),
(42, '日間部', '四技', '保險金融管理系', '二年級'),
(43, '日間部', '四技', '保險金融管理系', '三年級'),
(44, '日間部', '四技', '保險金融管理系', '四年級'),
(45, '日間部', '二技', '保險金融管理系', '一年級'),
(46, '日間部', '二技', '保險金融管理系', '二年級'),
(47, '日間部', '五專', '保險金融管理科', '一年級'),
(48, '日間部', '五專', '保險金融管理科', '二年級'),
(49, '日間部', '五專', '保險金融管理科', '三年級'),
(50, '日間部', '五專', '保險金融管理科', '四年級'),
(51, '日間部', '五專', '保險金融管理科', '五年級'),
(52, '進修部', '四技', '保險金融管理系', '一年級'),
(53, '進修部', '四技', '保險金融管理系', '二年級'),
(54, '進修部', '四技', '保險金融管理系', '三年級'),
(55, '進修部', '四技', '保險金融管理系', '四年級'),
(56, '日間部', '碩士班', '企業管理系', '一年級'),
(57, '日間部', '碩士班', '企業管理系', '二年級'),
(58, '日間部', '碩士在職專班', '企業管理系', '一年級'),
(59, '日間部', '碩士在職專班', '企業管理系', '二年級'),
(60, '日間部', '四技', '企業管理系', '一年級'),
(61, '日間部', '四技', '企業管理系', '二年級'),
(62, '日間部', '四技', '企業管理系', '三年級'),
(63, '日間部', '四技', '企業管理系', '四年級'),
(64, '日間部', '二技', '企業管理系', '一年級'),
(65, '日間部', '二技', '企業管理系', '二年級'),
(66, '日間部', '五專', '企業管理科', '一年級'),
(67, '日間部', '五專', '企業管理科', '二年級'),
(68, '日間部', '五專', '企業管理科', '三年級'),
(69, '日間部', '五專', '企業管理科', '四年級'),
(70, '日間部', '五專', '企業管理科', '五年級'),
(71, '進修部', '四技', '企業管理系', '一年級'),
(72, '進修部', '四技', '企業管理系', '二年級'),
(73, '進修部', '四技', '企業管理系', '三年級'),
(74, '進修部', '四技', '企業管理系', '四年級'),
(75, '進修部', '二技', '企業管理系', '一年級'),
(76, '進修部', '二技', '企業管理系', '二年級'),
(77, '空中學院', '二專', '企業管理科', '一年級'),
(78, '空中學院', '二專', '企業管理科', '二年級'),
(79, '日間部', '碩士班', '租稅管理與理財規劃碩士班', '一年級'),
(80, '日間部', '碩士班', '租稅管理與理財規劃碩士班', '二年級'),
(81, '日間部', '四技', '財政稅務系', '一年級'),
(82, '日間部', '四技', '財政稅務系', '二年級'),
(83, '日間部', '四技', '財政稅務系', '三年級'),
(84, '日間部', '四技', '財政稅務系', '四年級'),
(85, '日間部', '碩士班', '財務金融系', '一年級'),
(86, '日間部', '碩士班', '財務金融系', '二年級'),
(87, '日間部', '碩士在職專班', '財務金融系', '一年級'),
(88, '日間部', '碩士在職專班', '財務金融系', '二年級'),
(89, '日間部', '四技', '財務金融系', '一年級'),
(90, '日間部', '四技', '財務金融系', '二年級'),
(91, '日間部', '四技', '財務金融系', '三年級'),
(92, '日間部', '四技', '財務金融系', '四年級'),
(93, '日間部', '二技', '財務金融系', '一年級'),
(94, '日間部', '二技', '財務金融系', '二年級'),
(95, '進修部', '四技', '財務金融系', '一年級'),
(96, '進修部', '四技', '財務金融系', '二年級'),
(97, '進修部', '四技', '財務金融系', '三年級'),
(98, '進修部', '四技', '財務金融系', '四年級'),
(99, '進修部', '二技', '財務金融系', '一年級'),
(100, '進修部', '二技', '財務金融系', '二年級'),
(101, '進修部', '二專', '財務金融科', '一年級'),
(102, '進修部', '二專', '財務金融科', '二年級'),
(103, '空中學院', '二專', '財務金融科', '一年級'),
(104, '空中學院', '二專', '財務金融科', '二年級'),
(105, '日間部', '四技', '應用統計系', '一年級'),
(106, '日間部', '四技', '應用統計系', '二年級'),
(107, '日間部', '四技', '應用統計系', '三年級'),
(108, '日間部', '四技', '應用統計系', '四年級'),
(109, '日間部', '四技', '休閒事業經營系', '一年級'),
(110, '日間部', '四技', '休閒事業經營系', '二年級'),
(111, '日間部', '四技', '休閒事業經營系', '三年級'),
(112, '日間部', '四技', '休閒事業經營系', '四年級'),
(113, '進修部', '四技', '休閒事業經營系', '一年級'),
(114, '進修部', '四技', '休閒事業經營系', '二年級'),
(115, '進修部', '四技', '休閒事業經營系', '三年級'),
(116, '進修部', '四技', '休閒事業經營系', '四年級'),
(117, '進修部', '二技', '休閒事業經營系', '一年級'),
(118, '進修部', '二技', '休閒事業經營系', '二年級'),
(119, '空中學院', '二技', '應用商學系', '一年級'),
(120, '空中學院', '二技', '應用商學系', '二年級'),
(121, '日間部', '碩士班', '商業設計系', '一年級'),
(122, '日間部', '碩士班', '商業設計系', '二年級'),
(123, '日間部', '碩士在職專班', '商業設計系', '一年級'),
(124, '日間部', '碩士在職專班', '商業設計系', '二年級'),
(125, '日間部', '四技', '商業設計系', '一年級'),
(126, '日間部', '四技', '商業設計系', '二年級'),
(127, '日間部', '四技', '商業設計系', '三年級'),
(128, '日間部', '四技', '商業設計系', '四年級'),
(129, '日間部', '二技', '商業設計系', '一年級'),
(130, '日間部', '二技', '商業設計系', '二年級'),
(131, '進修部', '四技', '商業設計系', '一年級'),
(132, '進修部', '四技', '商業設計系', '二年級'),
(133, '進修部', '四技', '商業設計系', '三年級'),
(134, '進修部', '四技', '商業設計系', '四年級'),
(135, '進修部', '二技', '商業設計系', '一年級'),
(136, '進修部', '二技', '商業設計系', '二年級'),
(137, '進修部', '二專', '商業設計科', '一年級'),
(138, '進修部', '二專', '商業設計科', '二年級'),
(139, '日間部', '碩士班', '多媒體設計系', '一年級'),
(140, '日間部', '碩士班', '多媒體設計系', '二年級'),
(141, '日間部', '四技', '多媒體設計系', '一年級'),
(142, '日間部', '四技', '多媒體設計系', '二年級'),
(143, '日間部', '四技', '多媒體設計系', '三年級'),
(144, '日間部', '四技', '多媒體設計系', '四年級'),
(145, '日間部', '碩士班', '室內設計系', '一年級'),
(146, '日間部', '碩士班', '室內設計系', '二年級'),
(147, '日間部', '四技', '室內設計系', '一年級'),
(148, '日間部', '四技', '室內設計系', '二年級'),
(149, '日間部', '四技', '室內設計系', '三年級'),
(150, '日間部', '四技', '室內設計系', '四年級'),
(151, '進修部', '二技', '室內設計系', '一年級'),
(152, '進修部', '二技', '室內設計系', '二年級'),
(153, '日間部', '二技', '創意商品設計系(5+2)', '一年級'),
(154, '日間部', '二技', '創意商品設計系(5+2)', '二年級'),
(155, '日間部', '五專', '創意商品設計科(5+2)', '一年級'),
(156, '日間部', '五專', '創意商品設計科(5+2)', '二年級'),
(157, '日間部', '五專', '創意商品設計科(5+2)', '三年級'),
(158, '日間部', '五專', '創意商品設計科(5+2)', '四年級'),
(159, '日間部', '五專', '創意商品設計科(5+2)', '五年級'),
(160, '日間部', '碩士班', '資訊管理系', '一年級'),
(161, '日間部', '碩士班', '資訊管理系', '二年級'),
(162, '日間部', '碩士在職專班', '資訊管理系', '一年級'),
(163, '日間部', '碩士在職專班', '資訊管理系', '二年級'),
(164, '日間部', '四技', '資訊管理系', '一年級'),
(165, '日間部', '四技', '資訊管理系', '二年級'),
(166, '日間部', '四技', '資訊管理系', '三年級'),
(167, '日間部', '四技', '資訊管理系', '四年級'),
(168, '日間部', '二技', '資訊管理系', '一年級'),
(169, '日間部', '二技', '資訊管理系', '二年級'),
(170, '日間部', '五專', '資訊管理科', '一年級'),
(171, '日間部', '五專', '資訊管理科', '二年級'),
(172, '日間部', '五專', '資訊管理科', '三年級'),
(173, '日間部', '五專', '資訊管理科', '四年級'),
(174, '日間部', '五專', '資訊管理科', '五年級'),
(175, '進修部', '四技', '資訊管理系', '一年級'),
(176, '進修部', '四技', '資訊管理系', '二年級'),
(177, '進修部', '四技', '資訊管理系', '三年級'),
(178, '進修部', '四技', '資訊管理系', '四年級'),
(179, '進修部', '二技', '資訊管理系', '一年級'),
(180, '進修部', '二技', '資訊管理系', '二年級'),
(181, '進修部', '二專', '資訊管理科', '一年級'),
(182, '進修部', '二專', '資訊管理科', '二年級'),
(183, '空中學院', '二專', '資訊管理科', '一年級'),
(184, '空中學院', '二專', '資訊管理科', '二年級'),
(185, '日間部', '碩士班', '資訊工程系', '一年級'),
(186, '日間部', '碩士班', '資訊工程系', '二年級'),
(187, '日間部', '碩士在職專班', '資訊工程系', '一年級'),
(188, '日間部', '碩士在職專班', '資訊工程系', '二年級'),
(189, '日間部', '四技', '資訊工程系', '一年級'),
(190, '日間部', '四技', '資訊工程系', '二年級'),
(191, '日間部', '四技', '資訊工程系', '三年級'),
(192, '日間部', '四技', '資訊工程系', '四年級'),
(193, '日間部', '二技', '資訊工程系', '一年級'),
(194, '日間部', '二技', '資訊工程系', '二年級'),
(195, '日間部', '五專', '資訊工程科', '一年級'),
(196, '日間部', '五專', '資訊工程科', '二年級'),
(197, '日間部', '五專', '資訊工程科', '三年級'),
(198, '日間部', '五專', '資訊工程科', '四年級'),
(199, '日間部', '五專', '資訊工程科', '五年級'),
(200, '進修部', '四技', '資訊工程系', '一年級'),
(201, '進修部', '四技', '資訊工程系', '二年級'),
(202, '進修部', '四技', '資訊工程系', '三年級'),
(203, '進修部', '四技', '資訊工程系', '四年級'),
(204, '日間部', '碩士班', '流通管理系', '一年級'),
(205, '日間部', '碩士班', '流通管理系', '二年級'),
(206, '日間部', '碩士在職專班', '流通管理系', '一年級'),
(207, '日間部', '碩士在職專班', '流通管理系', '二年級'),
(208, '日間部', '四技', '流通管理系', '一年級'),
(209, '日間部', '四技', '流通管理系', '二年級'),
(210, '日間部', '四技', '流通管理系', '三年級'),
(211, '日間部', '四技', '流通管理系', '四年級'),
(212, '日間部', '二技', '流通管理系', '一年級'),
(213, '日間部', '二技', '流通管理系', '二年級'),
(214, '日間部', '二技', '資訊應用菁英班(5+2)', '一年級'),
(215, '日間部', '二技', '資訊應用菁英班(5+2)', '二年級'),
(216, '日間部', '五專', '資訊應用菁英班(5+2)', '一年級'),
(217, '日間部', '五專', '資訊應用菁英班(5+2)', '五年級'),
(218, '日間部', '四技', '人工智能應用工程學士學位學程', '一年級'),
(219, '日間部', '四技', '人工智能應用工程學士學位學程', '二年級'),
(220, '日間部', '四技', '人工智能應用工程學士學位學程', '三年級'),
(221, '日間部', '四技', '人工智能應用工程學士學位學程', '四年級'),
(222, '日間部', '博士班', '智慧工程博士班', '一年級'),
(223, '日間部', '博士班', '智慧工程博士班', '二年級'),
(224, '日間部', '博士班', '智慧工程博士班', '三年級'),
(225, '日間部', '碩士班', '日本市場暨商務策略碩士班', '一年級'),
(226, '日間部', '碩士班', '日本市場暨商務策略碩士班', '二年級'),
(227, '日間部', '四技', '應用日語系', '一年級'),
(228, '日間部', '四技', '應用日語系', '二年級'),
(229, '日間部', '四技', '應用日語系', '三年級'),
(230, '日間部', '四技', '應用日語系', '四年級'),
(231, '日間部', '二技', '應用日語系', '一年級'),
(232, '日間部', '二技', '應用日語系', '二年級'),
(233, '日間部', '五專', '應用日語科', '一年級'),
(234, '日間部', '五專', '應用日語科', '二年級'),
(235, '日間部', '五專', '應用日語科', '三年級'),
(236, '日間部', '五專', '應用日語科', '四年級'),
(237, '日間部', '五專', '應用日語科', '五年級'),
(238, '進修部', '二技', '應用日語系', '一年級'),
(239, '進修部', '二技', '應用日語系', '二年級'),
(240, '進修部', '二專', '應用日語科', '一年級'),
(241, '進修部', '二專', '應用日語科', '二年級'),
(242, '日間部', '四技', '應用英語系', '一年級'),
(243, '日間部', '四技', '應用英語系', '二年級'),
(244, '日間部', '四技', '應用英語系', '三年級'),
(245, '日間部', '四技', '應用英語系', '四年級'),
(246, '日間部', '二技', '應用英語系', '一年級'),
(247, '日間部', '二技', '應用英語系', '二年級'),
(248, '日間部', '五專', '應用英語科', '一年級'),
(249, '日間部', '五專', '應用英語科', '二年級'),
(250, '日間部', '五專', '應用英語科', '三年級'),
(251, '日間部', '五專', '應用英語科', '四年級'),
(252, '日間部', '五專', '應用英語科', '五年級'),
(253, '進修部', '四技', '應用英語系', '一年級'),
(254, '進修部', '四技', '應用英語系', '二年級'),
(255, '進修部', '四技', '應用英語系', '三年級'),
(256, '進修部', '四技', '應用英語系', '四年級'),
(257, '進修部', '二技', '應用英語系', '一年級'),
(258, '進修部', '二技', '應用英語系', '二年級'),
(259, '進修部', '二專', '應用英語科', '一年級'),
(260, '進修部', '二專', '應用英語科', '二年級'),
(261, '空中學院', '二專', '應用英語科', '一年級'),
(262, '空中學院', '二專', '應用英語科', '二年級'),
(263, '日間部', '四技', '應用中文系', '一年級'),
(264, '日間部', '四技', '應用中文系', '二年級'),
(265, '日間部', '四技', '應用中文系', '三年級'),
(266, '日間部', '四技', '應用中文系', '四年級'),
(267, '日間部', '碩士班', '護理系', '一年級'),
(268, '日間部', '碩士班', '護理系', '二年級'),
(269, '日間部', '碩士在職專班', '護理系', '一年級'),
(270, '日間部', '碩士在職專班', '護理系', '二年級'),
(271, '日間部', '四技', '護理系', '一年級'),
(272, '日間部', '四技', '護理系', '二年級'),
(273, '日間部', '四技', '護理系', '三年級'),
(274, '日間部', '四技', '護理系', '四年級'),
(275, '日間部', '二技', '護理系', '一年級'),
(276, '日間部', '二技', '護理系', '二年級'),
(277, '日間部', '五專', '護理科', '一年級'),
(278, '日間部', '五專', '護理科', '二年級'),
(279, '日間部', '五專', '護理科', '三年級'),
(280, '日間部', '五專', '護理科', '四年級'),
(281, '日間部', '五專', '護理科', '五年級'),
(282, '日間部', '碩士班', '美容系', '一年級'),
(283, '日間部', '碩士班', '美容系', '二年級'),
(284, '日間部', '四技', '美容系', '一年級'),
(285, '日間部', '四技', '美容系', '二年級'),
(286, '日間部', '四技', '美容系', '三年級'),
(287, '日間部', '四技', '美容系', '四年級'),
(288, '日間部', '二技', '美容系', '一年級'),
(289, '日間部', '二技', '美容系', '二年級'),
(290, '進修部', '四技', '美容系', '一年級'),
(291, '進修部', '四技', '美容系', '二年級'),
(292, '進修部', '四技', '美容系', '三年級'),
(293, '進修部', '四技', '美容系', '四年級'),
(294, '進修部', '二技', '美容系', '一年級'),
(295, '進修部', '二技', '美容系', '二年級'),
(296, '日間部', '四技', '老人服務事業管理系', '一年級'),
(297, '日間部', '四技', '老人服務事業管理系', '二年級'),
(298, '日間部', '四技', '老人服務事業管理系', '三年級'),
(299, '日間部', '四技', '老人服務事業管理系', '四年級'),
(300, '日間部', '二技', '老人服務事業管理系', '一年級'),
(301, '日間部', '二技', '老人服務事業管理系', '二年級'),
(302, '進修部', '四技', '老人服務事業管理系', '一年級'),
(303, '進修部', '四技', '老人服務事業管理系', '二年級'),
(304, '進修部', '四技', '老人服務事業管理系', '三年級'),
(305, '進修部', '四技', '老人服務事業管理系', '四年級'),
(306, '進修部', '二技', '老人服務事業管理系', '一年級'),
(307, '進修部', '二技', '老人服務事業管理系', '二年級'),
(308, '日間部', '二技', '商業經營系', '一年級'),
(309, '日間部', '二技', '商業經營系', '二年級'),
(310, '進修部', '四技', '商業經營系', '一年級'),
(311, '進修部', '四技', '商業經營系', '二年級'),
(312, '進修部', '四技', '商業經營系', '三年級'),
(313, '進修部', '四技', '商業經營系', '四年級'),
(314, '進修部', '二專', '商業經營科', '一年級'),
(315, '進修部', '二專', '商業經營科', '二年級'),
(316, '日間部', '四技', '智慧生產工程系', '一年級'),
(317, '日間部', '四技', '智慧生產工程系', '二年級'),
(318, '日間部', '四技', '智慧生產工程系', '三年級'),
(319, '日間部', '四技', '智慧生產工程系', '四年級'),
(320, '日間部', '五專', '資訊應用菁英班(5+2)', '二年級'),
(321, '日間部', '五專', '資訊應用菁英班(5+2)', '三年級'),
(322, '日間部', '五專', '資訊應用菁英班(5+2)', '四年級');

-- --------------------------------------------------------

--
-- 資料表結構 `comment`
--
-- 建立時間： 2026-03-17 10:10:35
--

DROP TABLE IF EXISTS `comment`;
CREATE TABLE `comment` (
  `transId` int(255) NOT NULL,
  `comment` varchar(255) NOT NULL,
  `score` int(10) NOT NULL,
  `product_compliance` varchar(255) NOT NULL,
  `id_buy` int(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- 資料表新增資料前，先清除舊資料 `comment`
--

TRUNCATE TABLE `comment`;
-- --------------------------------------------------------

--
-- 資料表結構 `conversation`
--
-- 建立時間： 2026-03-17 10:31:31
--

DROP TABLE IF EXISTS `conversation`;
CREATE TABLE `conversation` (
  `cid` int(255) NOT NULL,
  `roomId` int(255) NOT NULL,
  `datetime` datetime NOT NULL,
  `flag` int(1) NOT NULL,
  `msg` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- 資料表新增資料前，先清除舊資料 `conversation`
--

TRUNCATE TABLE `conversation`;
-- --------------------------------------------------------

--
-- 資料表結構 `room`
--
-- 建立時間： 2026-03-17 10:17:18
--

DROP TABLE IF EXISTS `room`;
CREATE TABLE `room` (
  `roomId` int(255) NOT NULL,
  `read` varchar(10) NOT NULL,
  `id` int(255) NOT NULL,
  `transId` int(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 資料表新增資料前，先清除舊資料 `room`
--

TRUNCATE TABLE `room`;
-- --------------------------------------------------------

--
-- 資料表結構 `secondhandbook`
--
-- 建立時間： 2026-03-17 10:01:25
--

DROP TABLE IF EXISTS `secondhandbook`;
CREATE TABLE `secondhandbook` (
  `transId` int(255) NOT NULL,
  `isbn` varchar(20) NOT NULL,
  `bookimg` varchar(255) NOT NULL,
  `bookName` varchar(20) NOT NULL,
  `author` varchar(50) NOT NULL,
  `publisher` varchar(30) NOT NULL,
  `origPrice` varchar(20) NOT NULL,
  `teacher` varchar(30) NOT NULL,
  `bookCondition` varchar(255) NOT NULL,
  `price` varchar(20) NOT NULL,
  `state` varchar(20) NOT NULL,
  `transDate` timestamp(6) NOT NULL DEFAULT current_timestamp(6) ON UPDATE current_timestamp(6),
  `id_sell` int(11) NOT NULL,
  `id_buy` int(255) NOT NULL,
  `classNo` int(255) NOT NULL,
  `cartId` int(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 資料表新增資料前，先清除舊資料 `secondhandbook`
--

TRUNCATE TABLE `secondhandbook`;
-- --------------------------------------------------------

--
-- 資料表結構 `student`
--
-- 建立時間： 2026-03-17 09:18:05
--

DROP TABLE IF EXISTS `student`;
CREATE TABLE `student` (
  `sId` int(10) NOT NULL,
  `name` varchar(10) NOT NULL,
  `password` varchar(8) NOT NULL,
  `major` char(4) NOT NULL,
  `eduSystem` char(255) NOT NULL,
  `img` varchar(255) NOT NULL,
  `mail` varchar(255) NOT NULL,
  `id` int(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 資料表新增資料前，先清除舊資料 `student`
--

TRUNCATE TABLE `student`;
--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `cart`
--
ALTER TABLE `cart`
  ADD PRIMARY KEY (`cartId`),
  ADD KEY `fk_Id` (`id`),
  ADD KEY `fk_transId` (`transId`);

--
-- 資料表索引 `class`
--
ALTER TABLE `class`
  ADD PRIMARY KEY (`classNo`);

--
-- 資料表索引 `comment`
--
ALTER TABLE `comment`
  ADD PRIMARY KEY (`transId`),
  ADD KEY `fk_comment_id_buy` (`id_buy`);

--
-- 資料表索引 `conversation`
--
ALTER TABLE `conversation`
  ADD PRIMARY KEY (`cid`),
  ADD KEY `fk_conversation_roomId` (`roomId`);

--
-- 資料表索引 `room`
--
ALTER TABLE `room`
  ADD PRIMARY KEY (`roomId`),
  ADD KEY `fk_room_id` (`id`),
  ADD KEY `fk_room_transId` (`transId`);

--
-- 資料表索引 `secondhandbook`
--
ALTER TABLE `secondhandbook`
  ADD PRIMARY KEY (`transId`),
  ADD KEY `fk_id_sell` (`id_sell`),
  ADD KEY `fk_id_buy` (`id_buy`),
  ADD KEY `fk_cartId` (`cartId`),
  ADD KEY `fk_secondhandbook_classNo` (`classNo`);

--
-- 資料表索引 `student`
--
ALTER TABLE `student`
  ADD PRIMARY KEY (`id`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `cart`
--
ALTER TABLE `cart`
  MODIFY `cartId` int(255) NOT NULL AUTO_INCREMENT;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `class`
--
ALTER TABLE `class`
  MODIFY `classNo` int(255) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=323;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `comment`
--
ALTER TABLE `comment`
  MODIFY `transId` int(255) NOT NULL AUTO_INCREMENT;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `conversation`
--
ALTER TABLE `conversation`
  MODIFY `cid` int(255) NOT NULL AUTO_INCREMENT;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `student`
--
ALTER TABLE `student`
  MODIFY `id` int(255) NOT NULL AUTO_INCREMENT;

--
-- 已傾印資料表的限制式
--

--
-- 資料表的限制式 `cart`
--
ALTER TABLE `cart`
  ADD CONSTRAINT `fk_Id` FOREIGN KEY (`id`) REFERENCES `student` (`id`),
  ADD CONSTRAINT `fk_transId` FOREIGN KEY (`transId`) REFERENCES `secondhandbook` (`transId`);

--
-- 資料表的限制式 `comment`
--
ALTER TABLE `comment`
  ADD CONSTRAINT `fk_comment_id_buy` FOREIGN KEY (`id_buy`) REFERENCES `secondhandbook` (`id_buy`),
  ADD CONSTRAINT `fk_comment_transId` FOREIGN KEY (`transId`) REFERENCES `secondhandbook` (`transId`);

--
-- 資料表的限制式 `conversation`
--
ALTER TABLE `conversation`
  ADD CONSTRAINT `fk_conversation_roomId` FOREIGN KEY (`roomId`) REFERENCES `room` (`roomId`);

--
-- 資料表的限制式 `room`
--
ALTER TABLE `room`
  ADD CONSTRAINT `fk_room_id` FOREIGN KEY (`id`) REFERENCES `student` (`id`),
  ADD CONSTRAINT `fk_room_transId` FOREIGN KEY (`transId`) REFERENCES `secondhandbook` (`transId`);

--
-- 資料表的限制式 `secondhandbook`
--
ALTER TABLE `secondhandbook`
  ADD CONSTRAINT `fk_cartId` FOREIGN KEY (`cartId`) REFERENCES `cart` (`cartId`),
  ADD CONSTRAINT `fk_id_buy` FOREIGN KEY (`id_buy`) REFERENCES `student` (`id`),
  ADD CONSTRAINT `fk_id_sell` FOREIGN KEY (`id_sell`) REFERENCES `student` (`id`),
  ADD CONSTRAINT `fk_secondhandbook_classNo` FOREIGN KEY (`classNo`) REFERENCES `class` (`classNo`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
